{
  "Anime": [
    {
      "title": "Naruto",
      "rating": "8.3",
      "description": "Naruto (Japanese: NARUTO) is a Japanese manga series written and illustrated by Masashi Kishimoto. It tells the story of Naruto Uzumaki, a young ninja who seeks recognition from his peers and dreams of becoming the Hokage, the leader of his village. The story is told in two parts – the first set in Naruto's pre-teen years, and the second in his teens. The series is based on two one-shot manga by Kishimoto: Karakuri (1995), which earned Kishimoto an honorable mention in Shueisha's monthly Hop Step Award the following year, and Naruto (1997). Naruto is the fourth best-selling manga series in history having 250 million copies in circulation worldwide in 47 countries and regions, with 153 million copies in Japan alone and remaining 97 million copies elsewhere. It has become one of Viz Media's best-selling manga series; their English translations of the volumes have appeared on USA Today and The New York Times bestseller list several times, and the seventh volume won a Quill Award in 2006. Reviewers praised the manga's character development, strong storylines, and well-executed fight scenes, though some felt the fight scenes slowed the story down. Critics noted that the manga, which has a coming-of-age theme, makes use of cultural references from Japanese mythology and Confucianism.",
      "genre": "Action, Adventure",
      "image": "naruto.jpg"
    },
    {
      "title": "Attack On Titan",
      "rating": "9.0",
      "description": "Attack on Titan (Japanese: 進撃の巨人, Hepburn: Shingeki no Kyojin, lit. \"The Advancing Giants\") is a Japanese manga series written and illustrated by Hajime Isayama. It is set in a world where humanity lives inside cities surrounded by three enormous walls that protect them from the gigantic man-eating humanoids referred to as Titans; the story follows Eren Yeager, who vows to exterminate the Titans after a Titan brings about the destruction of his hometown and the death of his mother. Attack on Titan was serialized in Kodansha's monthly shōnen manga magazine Bessatsu Shōnen Magazine from September 2009 to April 2021, with its chapters collected in 34 tankōbon volumes.\n\nAn anime television series was produced by Wit Studio (seasons 1–3) and MAPPA (season 4). A 25-episode first season was broadcast from April to September 2013, followed by a 12-episode second season broadcast from April to June 2017. A 22-episode third season was broadcast in two parts, with the first 12 episodes airing from July to October 2018 and the last 10 episodes airing from April to July 2019. A fourth and final season premiered in December 2020, airing 16 episodes in its first part, with the remainder announced to begin airing in January 2022.\n\nAttack on Titan has become a critical and commercial success. As of December 2019, the manga has over 100 million tankōbon copies in print worldwide, making it one of the best-selling manga series of all time. It has won several awards, including the Kodansha Manga Award, the Attilio Micheluzzi Award, and the Harvey Award. ",
      "genre": "Action, Adventure",
      "image": "aot.jpg"
    },
    {
      "title": "Darling in the Franxx",
      "rating": "7.4",
      "description": "Darling in the Franxx (Japanese: ダーリン・イン・ザ・フランキス, Hepburn: Dārin In Za Furankisu), abbreviated as DarliFra (ダリフラ, DariFura),[6] is a 2018 Japanese science fiction romance anime television series co-produced by A-1 Pictures and Trigger and animated by Trigger and CloverWorks that premiered in January 2018.[7][8] The series was announced at Trigger's Anime Expo 2017 panel in July 2017.[9] A manga adaptation by Kentaro Yabuki and another four-panel comic strip manga began serialization in January 2018.[10]\n\nDarling in the Franxx is set in a dystopian future where children are artificially created and indoctrinated solely to defend the remnants of civilization. The story follows a squad of ten pilots, particularly focusing on the partnership between Hiro, a former prodigy, and Zero Two, a hybrid human and elite pilot who aspires to become entirely human.\n\nThe animation began international distribution simultaneously upon its domestic release. The streaming service Crunchyroll internationally simulcast the series, with Aniplus Asia simulcasting the series in Southeast Asia. Service partner Funimation began the dubbed release of the series in February 2018.[",
      "genre": "Action, Drama",
      "image": "ditf.jpg"
    },
    {
      "title": "Death Note",
      "rating": "9.0",
      "description": "In Tokyo, a disaffected high-school student named Light Yagami finds the \"Death Note\", a mysterious black notebook that can kill anyone as long as the user knows both the target's name and face. Initially terrified of its god-like power, Light considers the possibilities of the Death Note's abilities and kills high-profile Japanese criminals, then targets international criminals. Five days after discovering the notebook, Light is visited by Ryuk, a \"Shinigami\" and the Death Note's previous owner. Ryuk, invisible to anyone who has not touched the notebook, reveals that he dropped the notebook into the human world out of boredom and is amused by Light's actions.[5]\n\nAs criminals around the world die from inexplicable accidents and heart attacks, the global media suggest that a single mastermind is responsible for the mysterious murders and name him \"Kira\" (キラ, the Japanese transliteration of the English word \"killer\"). Hoping to apprehend Kira, Interpol requests the assistance of an enigmatic consulting detective, known as L, to assist their investigation. Deducing that Kira is based in Japan, L tricks Light into revealing that he is in the Kanto region of Japan by manipulating him to kill a decoy. Furious, Light vows to kill L, whom he views as obstructing his plans. L deduces that Kira has inside knowledge of the Japanese police investigation, being led by Light's father, Soichiro Yagami. Under the suspicion that \"Kira\" could have family ties with members of the \"Kira\" investigation, L assigns a team of FBI agents to monitor the families of those connected with the investigation and L learns enough to designate Light as the prime suspect. Around this time, Light graduates from high school to college. L recruits Light into the Kira Task Force, with each trying to get the other to reveal crucial information.\n\nActress-model Misa Amane, having obtained a second Death Note from a Shinigami named Rem, makes a deal with Rem for Shinigami eyes, which allow her to kill knowing only the face, at the cost of half her lifespan. Seeking to have Light become her boyfriend, Misa uncovers Light's identity as the original Kira, but Light has another motive: he intends to use Misa's Shinigami eyes to discern L's true name. L deduces that Misa is likely the second Kira and detains her. Rem threatens to kill Light if he does not find a way to save Misa. Light arranges a scheme in which he and Misa temporarily lose their memories of the Death Note, and has Rem pass the Death Note to a less morally driven individual, Kyosuke Higuchi of the Yotsuba Group. With memories of the Death Note erased, Light joins the investigation and, together with L, deduce Higuchi's identity and arrest him. Light regains his memories and uses the Death Note to kill Higuchi, regaining possession of the book. After restoring Misa's memories, Light instructs her to begin killing as Kira, causing L to cast suspicion on Misa. With Light insinuating the investigation would lead to Misa's capture and execution, Rem realizes Light's plan all along was to have her sacrifice herself to kill L, as a Shinigami may not kill others to prevent a human's death. After Rem kills L, she disintegrates and Light obtains her Death Note. The task force does not announce L's death and agrees to have Light operate as the new L. With Light working as both L and Kira, the investigation stalls but crime rates continue to drop as he no longer has a threat of capture.\n\nFour years later, cults have arisen which adore Kira. Two young men, raised as potential successors to L, are revealed: Near and Mello. Aware that L is dead, they consider Light, the current L, as a prime suspect. Mello, with Mafia assistance, kidnaps Light's sister, resulting in his father's death during a rescue mission. As suspicion falls again on Misa, Light passes Misa's Death Note to a fervent supporter of Kira, Teru Mikami. He also appoints newscaster Kiyomi Takada as Kira's public spokesperson. Realizing that Takada is connected to Kira, Mello kidnaps her. Takada kills Mello but is killed by Light. Near deduces Mikami's connection to Kira and arranges a meeting between Light and the current Kira Task Force members. Light tries to have Mikami kill Near as well as all the task force members, but Mikami's Death Note fails to work, having been replaced with a decoy. Perusing the names Mikami had written down, only Light's is missing, which proves Light is Kira. Light is grievously wounded in a scuffle and begs Ryuk to write the names of everyone present. Ryuk instead writes down Light's name in his Death Note, as Light declares himself as the god of the new world before dying.\n\nThree years later, Near, now functioning as the new L, receives word that a new Kira has appeared. Hearing that the new Kira is randomly killing people, Near concludes that the new Kira is an attention-seeker and denounces the new Kira as \"boring\" and not worth catching. A Shinigami named Midora approaches Ryuk and gives him an apple from the human realm, in a bet to see if a random human could become the new Kira, but Midora loses the bet when the human writes his own name in the Death Note after hearing Near's announcement. Ryuk tells Midora that no human would ever surpass Light as the new Kira. ",
      "genre": "Crime, Drama",
      "image": "dn.jpg"
    },
    {
      "title": "Dragon Ball Z",
      "rating": "8.7",
      "description": "A humanoid alien named Raditz arrives on Earth in a spacecraft and tracks down Goku, revealing to him that he is his long-lost older brother and that they are members of a near-extinct alien warrior race called the Saiyans (サイヤ人, Saiya-jin). The Saiyans had sent Goku (originally named \"Kakarot\") to Earth as an infant to conquer the planet for them, but he suffered a severe blow to the head shortly after his arrival and lost all memory of his mission, as well as his blood-thirsty Saiyan nature.\n\nRaditz along with two elites, Vegeta and Nappa, are the only remaining Saiyan warriors, so Raditz comes to enlist Goku's help in conquering frontier worlds. When Goku refuses to join them, Raditz takes Goku and Krillin down with one strike, kidnaps Gohan, and threatens to murder him if Goku doesn't kill 100 humans within the next 24 hours. Goku decides to team up with his arch-enemy Piccolo, who was also defeated by Raditz in an earlier encounter, to defeat him and save his son. During the battle, Gohan's rage momentarily makes him stronger than Piccolo and Goku as he attacks Raditz to protect his father. The battle ends with Goku restraining Raditz so that Piccolo can hit them with a deadly move called Special Beam Cannon (魔貫光殺砲, Makankōsappō), mortally wounding them both. Before Raditz succumbs to his injuries, he reveals to Piccolo that the other two Saiyans are much stronger than him and will come for the Dragon Balls in one year.\n\nHaving witnessed Gohan's latent potential, Piccolo takes him into the wilderness to train for the upcoming battle against the Saiyan Elites. In the afterlife, Goku travels the million-kilometer Snake Way so that he can train under the ruler of the North Galaxy, King Kai. King Kai teaches him the Kaio-ken (界王拳) and Spirit Bomb (Genki Dama (元気玉)) techniques. Despite his gruff nature, Piccolo grows fond of Gohan while he oversees him learning to fend for himself. This forges an unlikely emotional bond between the two.\n\nAfter a year, Goku is revived with the Dragon Balls, but King Kai panics as he realizes that Goku will have to take Snake Way again to get back and won't make it until hours after the Saiyans arrive. Goku's allies group up to fight until Goku gets back, but prove to be no match for Nappa and the \"Prince of All Saiyans\", Vegeta. Yamcha, Tien Shinhan, Chiaotzu and Piccolo all perish in the battle, with Piccolo's death causing both Kami and the Dragon Balls to fade from existence. When Goku finally arrives at the battlefield, he avenges his fallen friends by easily defeating Nappa before crippling him by breaking his spine in half. A furious Vegeta then executes Nappa for his failure to kill Goku.\n\nGoku uses several grades of the Kaio-ken to win the first clash with Vegeta, which concludes with a climactic ki beam struggle, but it comes at a great cost to his body. Vegeta comes back and creates an artificial moon to transform into a Great Ape, which he uses to torture Goku. Krillin and Gohan sense that Goku is in trouble, and they return for a group fight with the now-seemingly unstoppable Vegeta. They are aided at key moments by Yajirobe, who cuts Vegeta's tail to revert him into his normal state. Goku gives Krillin a Spirit Bomb that he made, and Krillin uses it to severely damage Vegeta. Vegeta is ultimately defeated when he is crushed by Gohan's Great Ape form, and he retreats to his spaceship as Krillin approaches to finish him off. Goku convinces Krillin to spare Vegeta's life and allow him to escape Earth, with Vegeta vowing to return and destroy the planet in revenge for his humiliation at Goku's hands. ",
      "genre": "Action, Adventure",
      "image": "dragon.jpg"
    },
    {
      "title": "Erased",
      "rating": "8.5",
      "description": "Erased, known in Japan as Boku dake ga Inai Machi (僕だけがいない街, lit. \"The Town Where Only I Am Missing\"; abbr. 僕街, BokuMachi), is a Japanese manga series written and illustrated by Kei Sanbe. It was serialized in Kadokawa Shoten's Young Ace magazine from June 2012 to March 2016, and is licensed in English by Yen Press.[4][5] An anime adaptation by A-1 Pictures aired on Fuji TV's Noitamina programming block from January to March 2016, and a live action film was released in March 2016. A live-action drama series was released by Netflix in December 2017.[6] A spin-off manga was published from June to November 2016[7] and the spin-off novel series by Hajime Ninomae was released in Kadokawa's Bungei Kadokawa magazine from November 2015 to March 2016.  The story follows Satoru Fujinuma, a young man living in Chiba who possesses an ability known as \"Revival\" that sends him back in time moments before a life-threatening incident, enabling him to prevent it from happening again. When his mother is murdered by an unknown assailant in his own home, Satoru's ability sends him back eighteen years into the past and Satoru is given the opportunity to not only save his mother, but also prevent a kidnapping incident that took the lives of three of his childhood friends.",
      "genre": "Drama, Fantasy",
      "image": "erased.jpg"
    },
    {
      "title": "Fullmetal Alchemist: Brotherhood",
      "rating": "9.1",
      "description": "Brothers Edward and Alphonse Elric are raised by their mother Trisha Elric in the remote village of Resembool in the country of Amestris. Their father Hohenheim, a noted and very gifted alchemist, abandoned his family while the boys were still young, and while in Trisha's care they began to show an affinity for alchemy and became curious about its secrets. However, when Trisha died of a lingering illness, they were cared for by their best friend Winry Rockbell and her grandmother Pinako. The boys traveled the world to advance their alchemic training under Izumi Curtis. Upon returning home, the two decide to try to bring their mother back to life with alchemy. However, human transmutation is a taboo, as it is impossible to do so properly. In the failed transmutation that results in Al's body being completely obliterated, and Ed losing his left leg. In a last ditch attempt to keep his brother alive, Ed sacrifices his right arm to bring Al's soul back and houses it in a nearby suit of armor. After Edward receives automail prosthetics from Winry and Pinako, the brothers decide to burn their childhood home down (symbolizing their determination and decision of \"no turning back\") and head to the capital city to become government sanctioned State Alchemists. After passing the exam, Edward is dubbed the \"Fullmetal Alchemist\" by the State Military, and the brothers begin their quest to regain their full bodies back through the fabled Philosopher's Stone, under the direction of Colonel Roy Mustang. Along the way, they discover a deep government conspiracy to hide the true nature of the Philosopher's Stone that involves the homunculi, the alchemists of the neighboring nation of Xing, the scarred man from the war-torn nation of Ishval, and their own father's past. ",
      "genre": "Action, Adventure",
      "image": "fullmetal.jpg"
    },
    {
      "title": "Tokyo Ghoul",
      "rating": "7.8",
      "description": "The story follows Ken Kaneki, a student who barely survives a deadly encounter with Rize Kamishiro, his date who reveals herself as a ghoul and tries to eat him. He is taken to the hospital in critical condition. After recovering, Kaneki discovers that he underwent a surgery that transformed him into a half-ghoul. This was accomplished because some of Rize's organs were transferred into his body, and now, like normal ghouls, he must consume human flesh to survive. Ghouls who run a coffee shop called \"Anteiku\" (あんていく) take him in and teach him to deal with his new life as a half-ghoul. Some of his daily struggles include fitting into the ghoul society, as well as keeping his identity hidden from his human companions, especially from his best friend, Hideyoshi Nagachika.\n\nThe prequel series Tokyo Ghoul [Jack] follows the youths of Kishō Arima and Taishi Fura, two characters from the main series who become acquainted when they join forces to investigate the death of Taishi's friend at the hands of a ghoul, leading to Taishi eventually following Arima's path and joining the CCG (Commission of Counter Ghoul), the federal agency tasked into dealing with crimes related to ghouls as well.\n\nThe sequel series Tokyo Ghoul:re follows an amnesiac Kaneki under the new identity of Haise Sasaki (the result of horrific brain damage sustained from Kishō Arima). He is the mentor of a special team of CCG investigators called \"Quinx Squad\" that underwent a similar procedure as his, allowing them to obtain the special abilities of Ghouls in order to fight them but still being able to live as normal humans. ",
      "genre": "Action, Drama",
      "image": "ghoul.jpg"
    },
    {
      "title": "Haikyuu!",
      "rating": "8.7",
      "description": "Junior high school student, Shōyō Hinata, becomes obsessed with volleyball after catching a glimpse of Karasuno High School playing in Nationals on TV. Of short stature himself, Hinata is inspired by a player the commentators nickname 'The Little Giant', Karasuno's short but talented wing spiker. Though inexperienced, Hinata is athletic and has an impressive vertical jump. He joins his school's volleyball club – only to find he is its sole member, forcing him to spend the next two years trying to convince other students to help him practice.\n\nIn third and final year of junior high, some of Hinata's friends agree to join the club so he can compete in a tournament. In his first official game ever, they suffer a crushing defeat to the team favored to win the tournament – that included third-year Tobio Kageyama, a prodigy setter nicknamed 'The King of the Court' for both his skill and his brutal play style. The two spark a short rivalry, and after the game, Hinata vows to defeat Kageyama in high school.\n\nHinata studies and is accepted to Karasuno, the same high school the \"Little Giant\" played for, but is shocked to discover that Kageyama has also chosen to attend Karasuno.[8] Karasuno is revealed to have lost its reputation as a powerhouse school following the era of the Little Giant, often being referred to as 'The Wingless Crows' by other local teams.[9] However, by combining Kageyama's genius setting skills with Hinata's remarkable athleticism, the duo create an explosive new volleyball tactic and develop an unexpected but powerful setter-spiker partnership.\n\nAlong the way, Hinata and Kageyama push each other into reaching their full potential and Hinata develops relationships with his first real team, thus beginning Karasuno's journey of redemption to restore their reputation and make it to the Nationals. ",
      "genre": "Comedy, Drama",
      "image": "haikyuu.jpg"
    },
    {
      "title": "Horimiya",
      "rating": "8.2",
      "description": "Kyoko Hori is a bright and popular high school student, in contrast to her classmate Izumi Miyamura, a gloomy and seemingly nerdy, glasses-wearing boy. At home, Hori is a homebody who dresses down and looks after her younger brother, Souta. She takes every attempt to hide this from her classmates, as to not disrupt her social status and cause others to worry. One day, Souta comes home with a nosebleed. He had been accompanied by a boy with numerous piercings and tattoos, who introduces himself as Miyamura. After recognizing Hori, even when she is dressed down, they agree to keep their true identities concealed from their peers. However, over time, when the two begin to learn more about each other, they learn they have more in common then they originally thought. Together, they agree to assist one another in keeping their after-school identities a secret. As time moves on, the two suddenly find themselves closer than ever, eventually becoming a couple.",
      "genre": "Comedy, Drama",
      "image": "horimiya.jpg"
    },
    {
      "title": "Idaten Jump",
      "rating": "8.2",
      "description": "Sho Yamato is a boy who enjoys MTB (short for \"Mountain Terrain Biking\") a whole lot. He's always practiced at the \"X-Zone\" (a place which his dad Takeshi made for MTB) with his friends Kakeru and Makoto while riding on a bike his dad has built called \"Flame Kaiser\". One day, he was challenged to a race by a MTB team called Team Shark Tooth and whoever won the race will get the X-Zone. For Sho, the X-Zone had always been a place of happy memories. He had spent many days there with his father who had disappeared, so he could not lose the game. During the race with Team Shark Tooth's leader Gabu Samejima, black smoke suddenly covered the ground around them, and they were sent to another world that's also called the \"X-Zone.\"\n\nWhen Sho woke up, he found Kakeru, Makoto, and his MTB Flame Kaiser were also there. Of course, they did not know where they were. While they were wondering what had happened, MTB riders came. They challenged Sho to an Idaten battle, a form of MTB race in the X-Zone. They said the only way for Sho to return is by collecting 10 gold emblems by winning Idaten battles with their emblems while making their way to X-City which is at the epicenter of the X-Zone. This is how Sho came down to compete in Idaten Battles at various courses such as ghost towns, volcanoes, ancient ruins, deserts, and snow-topped mountains. Now Sho must Idaten Battle for the sake of returning home.\n\nBefore an Idaten Battle begins, the MTB riders would put on their bike helmets while quoting \"Ready, set, and go.\" When their bike helmets are on, a full mountain biking suit appears on them during the Idaten Battles.\n\nSho's group decide to go to the X-City, the main city of X-Zone so that they can get the 10 gold emblem and can return to their home. They also face off against Team Shark Tooth and their various allies even when he arrives in X-City where Gabu Samejima is their dictator. Gabu, in order to maintain his dictatorship over X-zone, steals the 10 gold emblems which Sho won and when Sho tried to get it the first time, he knocked him off with his bike's most powerful move \"Bloody Impact\" , and a part of X tower collapsed over Sho as a result but luckily Sho survived and his friends helped get pass the tight security which Gabu did for his safety.\n\nAfter returning home, Sho returned to X-Zone to find his lost father Takeshi and Kyoichi Shido while taking on the mysterious Team X. ",
      "genre": "Adventure, Sport",
      "image": "idaten.jpg"
    },
    {
      "title": "Jujutsu Kaisen",
      "rating": "8.7",
      "description": "Jujutsu Kaisen (呪術廻戦) is a Japanese manga series written and illustrated by Gege Akutami, serialized in Shueisha's Weekly Shōnen Jump since March 2018. The Jujutsu Kaisen chapters are collected and published by Shueisha, with seventeen tankōbon volumes released as of October 2021. The story follows high school student Yuji Itadori as he joins a secret organization of Jujutsu Sorcerers in order to kill a powerful Curse named Ryomen Sukuna, of whom Yuji becomes the host. Jujutsu Kaisen is a sequel to Akutami's Tokyo Metropolitan Curse Technical School, serialized in Shueisha's Jump GIGA from April to July 2017, later collected in a tankōbon volume, as Jujutsu Kaisen 0, in December 2018.\n\nJujutsu Kaisen is licensed for English-language release in North America by Viz Media, who has been publishing the manga in print since December 2019. Shueisha publishes the series in English on the Manga Plus online platform. Two novels, written by Ballad Kitaguni, were published in May 2019 and January 2020, respectively. A 24-episode anime television series adaptation by MAPPA aired on MBS from October 2020 to March 2021. The anime is licensed by Crunchyroll for streaming outside of Asia, who premiered an English dub in November 2020. The original soundtrack of the anime was released in April 2021.\n\nAs of October 2021, the Jujutsu Kaisen manga had over 55 million copies in circulation, including digital versions and Jujutsu Kaisen 0, making it one of the best-selling manga series of all time. ",
      "genre": "Action, Adventure",
      "image": "jjk.jpg"
    },
    {
      "title": "One Piece",
      "rating": "8.8",
      "description": "The series focuses on Monkey D. Luffy, a rubberized young man who, inspired by his childhood idol, the powerful pirate \"Red Haired\" Shanks, sets off on a journey from the East Blue Sea to find the mythical One Piece and proclaim himself the King of the Pirates. In an effort to organize his own crew, the Straw Hat Pirates,[Jp 1] Luffy rescues and befriends a pirate hunter and swordsman named Roronoa Zoro, and they head off in search of the titular treasure. They are joined in their journey by Nami, a money-obsessed thief and navigator; Usopp, a sniper and compulsive liar; and Vinsmoke Sanji, a perverted but chivalrous chef. They acquire a ship, the Going Merry[Jp 2], and engage in confrontations with notorious pirates of the East Blue. As Luffy and his crew set out on their adventures, others join the crew later in the series, including Tony Tony Chopper, an anthropomorphized reindeer doctor; Nico Robin, an archaeologist and former Baroque Works assassin; Franky, a cyborg shipwright; Brook, a skeleton musician and swordsman; and Jimbei, a fish-man helmsman and former member of the Seven Warlords of the Sea. Once the Going Merry becomes damaged beyond repair, the Straw Hat Pirates acquire a new ship, the Thousand Sunny,[Jp 3] built by Franky. Together, they encounter other pirates, bounty hunters, criminal organizations, revolutionaries, secret agents, and soldiers of the corrupt World Government, and various other friends and foes, as they sail the seas in pursuit of their dreams. ",
      "genre": "Action, Adventure",
      "image": "op.jpg"
    },
    {
      "title": "Naruto Shippuden",
      "rating": "8.6",
      "description": "A powerful fox known as the Nine-Tails attacks Konoha, the hidden leaf village in the Land of Fire, one of the Five Great Shinobi Countries in the Ninja World. In response, the leader of Konoha and the Fourth Hokage, Minato Namikaze seals the fox inside the body of his newborn son, Naruto Uzumaki, making Naruto a host of the beast;[i] this costs Naruto's father his life, and the Third Hokage returns from retirement to become the leader of Konoha again. Naruto is often scorned by Konoha's villagers for being the host of the Nine-Tails. Due to a decree by the Third Hokage forbidding any mention of these events, Naruto learns nothing about the Nine-Tails until 12 years later, when Mizuki, a renegade ninja, reveals the truth to Naruto. Naruto then defeats Mizuki in combat, earning the respect of his teacher, Iruka Umino.[ii]\n\nShortly afterward, Naruto becomes a ninja and joins with Sasuke Uchiha, against whom he often competes, and Sakura Haruno, on whom he has a crush, to form Team 7, under an experienced sensei, the elite ninja Kakashi Hatake. Like all the ninja teams from every village, Team 7 completes missions requested by the villagers, ranging from doing chores and being bodyguards to performing assassinations.\n\nAfter several missions, including a major one in the Land of Waves, Kakashi allows Team 7 to take a ninja exam, enabling them to advance to a higher rank and take on more difficult missions, known as Chunin Exams. During the exams, Orochimaru, a wanted criminal, invades Konoha and kills the Third Hokage for revenge. Jiraiya, one of the three legendary ninjas, declines the title of Fifth Hokage and searches with Naruto for Tsunade whom he chooses to become Fifth Hokage instead.\n\nDuring the search, it is revealed that Orochimaru wishes to train Sasuke because of his powerful genetic heritage, the Sharingan. [iii] After Sasuke attempts and fails to kill his older brother Itachi[iv], who had showed up in Konoha to kidnap Naruto, he joins Orochimaru, hoping to gain from him the strength needed to kill Itachi. The story takes a turn when Sasuke leaves the village: Tsunade sends a group of ninja, including Naruto, to retrieve Sasuke, but Naruto is unable to persuade or force him to come back. Naruto and Sakura do not give up on Sasuke: Naruto leaves Konoha to receive training from Jiraiya to prepare himself for the next time he encounters Sasuke, while Sakura becomes Tsunade's apprentice. ",
      "genre": "Action, Adventure",
      "image": "shippuden.jpg"
    },
    {
      "title": "Tokyo Revengers",
      "rating": "8.5",
      "description": "Takemichi Hanagaki, a 26-year-old freeter, learns one day that his middle school ex-girlfriend, Hinata Tachibana, as well as her younger brother Naoto, have been killed by the Tokyo Manji Gang. When Takemichi is pushed in front of a train, he teleports exactly 12 years into the past to 2005. While reliving his middle school years, Takemichi meets with Naoto and divulges the exact date he and Hinata will die. When they shake hands, Takemichi is suddenly transported back to the present, creating a time paradox where Naoto survives and is now a detective. Naoto deduces that every time they hold hands, Takemichi is transported 12 years into the past. Using his knowledge from the future, Takemichi vows to save Hinata.\n\nIn the past, Takemichi's friends are forced into underground matches led by Kiyomasa, a member of the Tokyo Manji Gang. Takemichi's determination to protect them gains the respect of the gang's leader, Mikey. Takemichi discovers that his new friendship with Mikey prevented one of his friends, Akkun, from going to jail in the present; however, after Akkun commits suicide out of fear, Takemichi realizes the Tokyo Manji Gang presents a stronger threat to his friends than he initially thought.\n\nAfter traveling back to the past, Takemichi finds that the Tokyo Manji Gang is declaring war on Moebius, a rival gang, to avenge Pah-chin's friend. Takemichi learns that Mikey's second-in-command, Draken, will eventually be killed and lead to Mikey becoming violent. Draken survives the rumble, but Pah-chin turns himself into the police after stabbing Moebius' leader, Osanai. This causes infighting within the Tokyo Manji Gang, as they disagree on how to help Pah-chin.\n\nTakemichi resolves Mikey and Draken's dispute; however, on August 3, 2005, the Tokyo Manji Gang are attacked by a group of Moebius members, who are led by Valhalla member Shūji Hanma. Takemichi learns that Peh-yan colluded with them out of anger for Mikey and Draken letting Pah-chin be arrested, while Kiyomasa had stabbed Draken for humiliating him and causing him to be exiled from the Tokyo Manji Gang. The Tokyo Manji Gang wins the fight and Draken recovers from his injuries. ",
      "genre": "Action, Crime",
      "image": "tokyo.jpg"
    }
  ]
}